#  Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции
# list = [2,3,5,9,3]
# def SummElementsInOddPositions(list):
#     summ = 0
#     i = 1
#     while i < len(list):
#         summ += list[i]
#         i += 2
#     return summ
# print(SummElementsInOddPositions(list))



