# Реализуйте выдачу случайного числа не использовать random.randint и вообще библиотеку random
import datetime
number = datetime.datetime.now()
print (number.microsecond)
