# Найти сумму чисел списка стоящих на нечетной позиции

my_list = [2, 3, 5, 9, 3]
print(sum(my_list[1::2]))